{
  "Home": "Home",
  "Projects": "Progetti",
  "Welcome": "Benvenuto, {{name}}",
  "Logout": "Esci",
  "Login": "Accedi",

  "Hi, I'm Luca Ferraresso.": "Ciao, sono Luca Ferraresso.",
  "I’m an enthusiastic Front-End Developer based in Venice, Italy. My expertise lies in React and JavaScript, and I'm dedicated to crafting responsive, engaging web experiences. I thrive on turning complex challenges into intuitive, user-friendly solutions and am always excited to explore new technologies and techniques.": "Sono un appassionato sviluppatore front-end situato vicino Venezia , (ITA). La mia esperienza si concentra su React e JavaScript, e l'obbiettivo è sempre quello di creare esperienze web responsive e coinvolgenti. Amo affrontare sfide complesse per trasformarle in soluzioni intuitive e user-friendly.",

  "Tech Stack": "Stack Tecnologico",
  "Recent Projects": "Progetti Recenti",
  "View All Projects": "Visualizza Tutti i Progetti",
  "MongoDB database operations": "Operazioni su database MongoDB",
  "ToDo-App": "App ToDo",
  "Ice-Cream menù App": "Menù Gelati",

  "Contacts": "Contatti",
  "About me": "Chi sono",
  "All Rights Reserved.": "Tutti i diritti riservati.",

  "Get in touch with me!": "Mettiti in contatto!",
  "Fill out the form below to send a message:": "Compila il modulo sottostante per inviarmi un messaggio:",
  "Feat. Luca Ferraresso": "Con Luca Ferraresso",
  "Via Caxias ## ### ##": "Via Caxias ## ### ##",
  "Tel: 334 83 66 ###": "Tel: 334 83 66 ###",

  "Message sent successfully": "Messaggio inviato con successo",
  "Name": "Nome",
  "Email": "Email",
  "Phone (optional)": "Telefono (opzionale)",
  "Message": "Messaggio",
  "Send Message": "Invia Messaggio",

  "aboutme": {
    "paragraph1": "Ciao, sono Luca Ferraresso e lavoro come Frontend Developer da sei mesi. Anche se sono relativamente nuovo nel settore, la mia passione per la tecnologia e il design mi spinge a imparare e migliorare continuamente.",
    "paragraph2": "Dal momento in cui ho scritto la mia prima riga di codice, sono rimasto affascinato dalla capacità della tecnologia di creare esperienze utente coinvolgenti e intuitive. Amo affrontare la sfida di trasformare idee complesse in siti web visivamente accattivanti e funzionali, che gli utenti apprezzano.",
    "paragraph3": "Sono molto interessato all'intersezione tra design e sviluppo, dove creatività e funzionalità si incontrano. Che si tratti di creare layout responsive, sperimentare con animazioni o ottimizzare le prestazioni, mi dedico a dare vita ai concetti di design sul web.",
    "paragraph4": "Sono entusiasta del viaggio che mi attende, desideroso di contribuire a progetti innovativi e impegnato a crescere come sviluppatore. Non vedo l'ora di costruire altre cose straordinarie e connettermi con chi condivide il mio entusiasmo per la tecnologia e il design."
  },

  "project.mongodb": "Un'interfaccia CRUD (Create, Read, Update, Delete) basata sul web, sviluppata con Next.js e collegata a un database MongoDB. Consente agli utenti di gestire una collezione di elementi effettuando operazioni di base come aggiungere nuovi elementi, visualizzare l'elenco, modificare quelli esistenti ed eliminare gli elementi.",
  "project.todoapp": "Un'app elegante e intuitiva per la gestione delle attività quotidiane. Gli utenti possono organizzare le attività in categorie come 'Sport', 'Cibo', 'Famiglia' e 'Altro', utilizzando pulsanti interattivi. Perfetta per mantenere la tua vita organizzata e sotto controllo.",
  "project.icecream": "Un sito web che presenta un menù di gelati con un design accattivante, offrendo un'esperienza utente fluida per esplorare i diversi gusti di gelato. Trasmette un'atmosfera divertente e estiva, ideale per gli amanti del gelato.",

  "Password": "Password",
  "Inserisci la tua email": "Inserisci la tua email",
  "Inserisci la tua password": "Inserisci la tua password",
  "Registrati": "Registrati",
  "Accedi": "Accedi",
  "Hai già un account? Accedi": "Hai già un account? Accedi",
  "Non hai un account? Registrati": "Non hai un account? Registrati",
  "Registrazione effettuata con successo! (LOGIN AUTOMATICO)": "Registrazione effettuata con successo! (LOGIN AUTOMATICO)",
  "Login effettuato con successo!": "Login effettuato con successo!",
  "Login fallito. Controlla le tue credenziali.": "Login fallito. Controlla le tue credenziali.",
  "Registrazione fallita. Riprova.": "Registrazione fallita. Riprova.",
  "Errore durante l'operazione. Riprova.": "Errore durante l'operazione. Riprova.",
  "Errore durante il logout: ": "Errore durante il logout: ",
  "Logout effettuato con successo!": "Logout effettuato con successo!",

  "projects": "Progetti",
  "description": {
    "advice-generator": "Il progetto ideale se stai imparando a interagire con API di terze parti. Questa sfida utilizza l'API Advice Slip per generare citazioni casuali di consigli.",
    "age-calculator": "Questa sfida è progettata per affinare le tue competenze in JavaScript e nella validazione dei moduli. Gestire le date in JavaScript può essere complicato, quindi sarà una bella prova!",
    "contact-form": "Creare moduli accessibili è un compito cruciale per gli sviluppatori front-end. Questa sfida ti aiuterà a esercitarti nella costruzione di un modulo con diversi tipi di input e validazione.",
    "mortgage-calculator": "Questo calcolatore di mutui è un eccellente progetto per esercitarsi con i moduli, la validazione lato client e l'aggiornamento del DOM. Ricorda di concentrarti anche sull'accessibilità!",
    "product-list-with-cart": "Pratica l'aggiornamento dell'interfaccia utente in più punti basati sulle azioni dell'utente. Il pacchetto iniziale include anche un file JSON per aiutarti a esercitarti nella popolazione dinamica del DOM.",
    "interactive-card-details-form": "Questo progetto divertente sarà un'ottima occasione per praticare la manipolazione del DOM e la validazione dei moduli, mettendo alla prova anche le tue competenze in HTML e CSS.",
    "tip-calculator": "Questa piccola app è perfetta per chi sta iniziando a prendere confidenza con JavaScript. La funzionalità del calcolatore sarà una buona sfida!",
    "interactive-pricing-components": "In questo progetto, costruirai un componente di pricing interattivo completo di slider per l'input e toggle per i prezzi. Un modo ideale per testare le tue competenze in JavaScript!",
    "news-letter-sign-up": "Questa sfida metterà alla prova le tue competenze nella struttura di base dei moduli, nella validazione e nell'invio. Lo stato di successo sarà anche un'eccellente opportunità per lavorare con la manipolazione del DOM.",
    "launch-countdown-timer": "Questo sarà un progetto divertente! La tua sfida è costruire un timer conto alla rovescia. Ci sono anche diversi piccoli test CSS nel design, quindi ti terrà occupato!",
    "expenses-chart-component": "In questa sfida, creerai un componente per grafici a barre da zero. Forniamo un file JSON locale, così potrai aggiungere dinamicamente i dati del grafico, se lo desideri.",
    "rock-paper-scissors-master": "Questa sfida metterà alla prova le tue competenze in HTML, CSS e JavaScript. C'è anche una versione Rock, Paper, Scissors, Lizard, Spock se vuoi davvero sfidarti.",
    "three-js-project": "Un'esperienza interattiva 3D costruita utilizzando Three.js e React, con rendering in tempo reale e controlli dinamici."
  },
  "title": {
    "advice-generator": "Generatore di Consigli",
    "age-calculator": "Calcolatore di Età",
    "contact-form": "Modulo di Contatto",
    "mortgage-calculator": "Calcolatore di Mutui",
    "product-list-with-cart": "Elenco Prodotti con Carrello",
    "interactive-card-details-form": "Modulo Interattivo per Dettagli Carta di Credito",
    "tip-calculator": "Calcolatore di Mance",
    "interactive-pricing-components": "Componente di Prezzi Interattivi",
    "news-letter-sign-up": "Iscrizione alla Newsletter",
    "launch-countdown-timer": "Timer con Conto alla Rovescia",
    "expenses-chart-component": "Componente Grafico delle Spese",
    "rock-paper-scissors-master": "Gioco: Sasso Carta Forbice",
    "three-js-project": "Progetto in 3D con Three.js"
  }
}
